two_dimensional_flow/remeshing/data/0_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application		simpleFoam;

startFrom		latestTime;

startTime		0;

stopAt			endTime;

endTime			20000;

deltaT			1;

writeControl		timeStep;

writeInterval		20000;

purgeWrite		1;

writeFormat		binary;

writePrecision		12;

writeCompression	off;

timeFormat		general;

timePrecision		6;

runTimeModifiable	yes;

functions
{
	residuals
	{
		type			solverInfo;
		libs			("libutilityFunctionObjects.so");
		enabled			true;
		writeControl		timeStep;
		writeInterval		1;
		fields			(U p);
	}

	force
	{
		type			forces;
		libs			("libforces.so");
		enabled			true;
		writeControl		timeStep;
		writeInterval		1;
		log			false;
		patches			(inner);
		CofR			(0 0 0);
		rhoInf			1.0;
		rho			rhoInf;
	}
}
