two_dimensional_flow/remeshing/data/0_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    ground
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3141;
        startFace       6214;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3141;
        startFace       9355;
    }
    inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       12496;
    }
    outer_cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          360;
        startFace       12512;
    }
)

// ************************************************************************* //
